# MADJI NDOGO PART 2

In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:ShUfFlEs%401999@localhost:3306/md_water_services

Connecting to 'mysql+pymysql://root:***@localhost:3306/md_water_services'

We had external auditors audit our data to make sure we had accurrate data collection. Now we analyze what they got with our original data to find the discrepancies

For the first question, we will have to compare the quality scores in the water_quality table to the auditor's scores. The auditor_report table
used location_id, but the quality scores table only has a record_id we can use. The visits table links location_id and record_id, so we
can link the auditor_report table and water_quality using the visits table.

11:37

So first, grab the location_id and true_water_source_score columns from auditor_report.

In [6]:
%%sql
SELECT 
    location_id,
    true_water_source_score
FROM
    auditor_report
LIMIT 5;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+-------------+-------------------------+
| location_id | true_water_source_score |
+-------------+-------------------------+
|  SoRu34980  |            1            |
|  AkRu08112  |            3            |
|  AkLu02044  |            0            |
|  AkHa00421  |            3            |
|  SoRu35221  |            0            |
+-------------+-------------------------+

Now, we join the visits table to the auditor_report table. Make sure to grab subjective_quality_score, record_id and location_id.

In [8]:
%%sql
SELECT 
    a.location_id AS audit_location,
    a.true_water_source_score,
    v.record_id,
    v.location_id As visit_location
FROM
    auditor_report AS a
JOIN 
    visits AS v
ON 
    a.location_id = v.location_id

LIMIT 5;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------+-------------------------+-----------+----------------+
| audit_location | true_water_source_score | record_id | visit_location |
+----------------+-------------------------+-----------+----------------+
|   SoRu34980    |            1            |    5185   |   SoRu34980    |
|   AkRu08112    |            3            |   59367   |   AkRu08112    |
|   AkLu02044    |            0            |   37379   |   AkLu02044    |
|   AkHa00421    |            3            |   51627   |   AkHa00421    |
|   SoRu35221    |            0            |   28758   |   SoRu35221    |
+----------------+-------------------------+-----------+----------------+

Now that we have the record_id for each location, our next step is to retrieve the corresponding scores from the water_quality table. We
are particularly interested in the subjective_quality_score. To do this, we'll JOIN the visits table and the water_quality table, using the
record_id as the connecting key.

In [9]:
%%sql
SELECT 
    a.location_id AS audit_location,
    a.true_water_source_score,
    v.record_id,
    v.location_id As visit_location,
    wq.subjective_quality_score
    
FROM
    auditor_report AS a
JOIN 
    visits AS v
ON 
    a.location_id = v.location_id
JOIN
    water_quality AS wq
ON
    v.record_id = wq.record_id

LIMIT 5;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------+-------------------------+-----------+----------------+--------------------------+
| audit_location | true_water_source_score | record_id | visit_location | subjective_quality_score |
+----------------+-------------------------+-----------+----------------+--------------------------+
|   SoRu34980    |            1            |    5185   |   SoRu34980    |            1             |
|   AkRu08112    |            3            |   59367   |   AkRu08112    |            3             |
|   AkLu02044    |            0            |   37379   |   AkLu02044    |            0             |
|   AkHa00421    |            3            |   51627   |   AkHa00421    |            3             |
|   SoRu35221    |            0            |   28758   |   SoRu35221    |            0             |
+----------------+-------------------------+-----------+----------------+--------------------------+

It doesn't matter if your columns are in a different format, because we are about to clean this up a bit. Since it is a duplicate, we can drop one of the location_id columns. Let's leave record_id and rename the scores to surveyor_score and auditor_score to make it clear which scores we're looking at in the results set.

In [10]:
%%sql
SELECT 
	a.location_id AS location,
     v.record_id,
    a.true_water_source_score AS audit_score,
    wq.subjective_quality_score AS employee_score 

FROM 
	md_water_services.auditor_report AS a
JOIN
	visits AS v
ON
	a.location_id = v.location_id
JOIN
	water_quality AS wq
ON
	v.record_id = wq.record_id
LIMIT 5;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+-----------+-----------+-------------+----------------+
|  location | record_id | audit_score | employee_score |
+-----------+-----------+-------------+----------------+
| SoRu34980 |    5185   |      1      |       1        |
| AkRu08112 |   59367   |      3      |       3        |
| AkLu02044 |   37379   |      0      |       0        |
| AkHa00421 |   51627   |      3      |       3        |
| SoRu35221 |   28758   |      0      |       0        |
+-----------+-----------+-------------+----------------+

Ok, let's analyse! A good starting point is to check if the auditor's and exployees' scores agree. There are many ways to do it. We can have a
WHERE clause and check if surveyor_score = auditor_score, or we can subtract the two scores and check if the result is 0.

In [13]:
%%sql
SELECT 
	a.location_id AS location,
     v.record_id,
    a.true_water_source_score AS audit_score,
    wq.subjective_quality_score AS employee_score 

FROM 
	md_water_services.auditor_report AS a
JOIN
	visits AS v
ON
	a.location_id = v.location_id
JOIN
	water_quality AS wq
ON
	v.record_id = wq.record_id
    
WHERE
	a.true_water_source_score = wq.subjective_quality_score
    
LIMIT 5;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+-----------+-----------+-------------+----------------+
|  location | record_id | audit_score | employee_score |
+-----------+-----------+-------------+----------------+
| SoRu34980 |    5185   |      1      |       1        |
| AkRu08112 |   59367   |      3      |       3        |
| AkLu02044 |   37379   |      0      |       0        |
| AkHa00421 |   51627   |      3      |       3        |
| SoRu35221 |   28758   |      0      |       0        |
+-----------+-----------+-------------+----------------+

You got 2505 rows right? Some of the locations were visited multiple times, so these records are duplicated here. To fix it, we set visits.visit_count
= 1 in the WHERE clause. Make sure you reference the alias you used for visits in the join.

In [16]:
%%sql
SELECT 
	a.location_id AS location,
     v.record_id,
    a.true_water_source_score AS audit_score,
    wq.subjective_quality_score AS employee_score 

FROM 
	md_water_services.auditor_report AS a
JOIN
	visits AS v
ON
	a.location_id = v.location_id
JOIN
	water_quality AS wq
ON
	v.record_id = wq.record_id
    
WHERE
	a.true_water_source_score = wq.subjective_quality_score
AND
	v.visit_count = 1
LIMIT 5;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+-----------+-----------+-------------+----------------+
|  location | record_id | audit_score | employee_score |
+-----------+-----------+-------------+----------------+
| SoRu34980 |    5185   |      1      |       1        |
| AkRu08112 |   59367   |      3      |       3        |
| AkLu02044 |   37379   |      0      |       0        |
| AkHa00421 |   51627   |      3      |       3        |
| SoRu35221 |   28758   |      0      |       0        |
+-----------+-----------+-------------+----------------+

But that means that 102 records are incorrect. So let's look at those. You can do it by adding one character in the last query!

In [17]:
%%sql
SELECT 
	a.location_id AS location,
     v.record_id,
    a.true_water_source_score AS audit_score,
    wq.subjective_quality_score AS employee_score 

FROM 
	md_water_services.auditor_report AS a
JOIN
	visits AS v
ON
	a.location_id = v.location_id
JOIN
	water_quality AS wq
ON
	v.record_id = wq.record_id
    
WHERE
	a.true_water_source_score != wq.subjective_quality_score
AND
	v.visit_count = 1
LIMIT 5;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+-----------+-----------+-------------+----------------+
|  location | record_id | audit_score | employee_score |
+-----------+-----------+-------------+----------------+
| AkRu05215 |   21160   |      3      |       10       |
| KiRu29290 |    7938   |      3      |       10       |
| KiHa22748 |   43140   |      9      |       10       |
| SoRu37841 |   18495   |      6      |       10       |
| KiRu27884 |   33931   |      1      |       10       |
+-----------+-----------+-------------+----------------+

Since we used some of this data in our previous analyses, we need to make sure those results are still valid, now we know some of them are
incorrect. We didn't use the scores that much, but we relied a lot on the type_of_water_source, so let's check if there are any errors there.
12:59

So, to do this, we need to grab the type_of_water_source column from the water_source table and call it survey_source, using the
source_id column to JOIN. Also select the type_of_water_source from the auditor_report table, and call it auditor_source.

In [18]:
%%sql
SELECT 
	a.location_id AS location,
	v.record_id,
	a.type_of_water_source AS auditor_source,
    ws.type_of_water_source AS survey_source,
    a.true_water_source_score AS audit_score,
    wq.subjective_quality_score AS employee_score
    
FROM 
	md_water_services.auditor_report AS a
JOIN
	visits AS v
ON
	a.location_id = v.location_id
JOIN
	water_quality AS wq
ON
	v.record_id = wq.record_id
JOIN
	water_source AS ws
ON
	a.type_of_water_source = ws.type_of_water_source

WHERE
	a.true_water_source_score != wq.subjective_quality_score
AND
	v.visit_count = 1
LIMIT 5 ;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+-----------+-----------+--------------------+--------------------+-------------+----------------+
|  location | record_id |   auditor_source   |   survey_source    | audit_score | employee_score |
+-----------+-----------+--------------------+--------------------+-------------+----------------+
| AmRu13433 |   57735   | tap_in_home_broken | tap_in_home_broken |      9      |       10       |
| AmRu13226 |   55271   | tap_in_home_broken | tap_in_home_broken |      9      |       10       |
| AmRu15719 |   34822   | tap_in_home_broken | tap_in_home_broken |      9      |       10       |
| AmRu14959 |    1556   | tap_in_home_broken | tap_in_home_broken |      9      |       10       |
| AmRu14887 |   31028   | tap_in_home_broken | tap_in_home_broken |      9      |       10       |
+-----------+-----------+--------------------+--------------------+-------------+----------------+

So what I can see is that the types of sources look the same! So even though the scores are wrong, the integrity of the type_of_water_source
data we analysed last time is not affected.


Once you're done, remove the columns and JOIN statement for water_sources again.

In [21]:
%%sql
SELECT 
	a.location_id AS location,
	v.record_id,
    a.true_water_source_score AS audit_score,
    wq.subjective_quality_score AS employee_score
    
FROM 
	md_water_services.auditor_report AS a
JOIN
	visits AS v
ON
	a.location_id = v.location_id
JOIN
	water_quality AS wq
ON
	v.record_id = wq.record_id

WHERE
	a.true_water_source_score != wq.subjective_quality_score
AND
	v.visit_count = 1
LIMIT 5 ;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+-----------+-----------+-------------+----------------+
|  location | record_id | audit_score | employee_score |
+-----------+-----------+-------------+----------------+
| AkRu05215 |   21160   |      3      |       10       |
| KiRu29290 |    7938   |      3      |       10       |
| KiHa22748 |   43140   |      9      |       10       |
| SoRu37841 |   18495   |      6      |       10       |
| KiRu27884 |   33931   |      1      |       10       |
+-----------+-----------+-------------+----------------+

Next up, let's look at where these errors may have come from. At some of the locations, employees assigned scores incorrectly, and those records
ended up in this results set.


I think there are two reasons this can happen.
1. These workers are all humans and make mistakes so this is expected.
2. Unfortunately, the alternative is that someone assigned scores incorrectly on purpose!

In either case, the employees are the source of the errors, so let's JOIN the assigned_employee_id for all the people on our list from the visits
table to our query. Remember, our query shows the shows the 102 incorrect records, so when we join the employee data, we can see which
employees made these incorrect records.

In [22]:
%%sql
SELECT 
	a.location_id AS location,
	v.record_id,
    v.assigned_employee_id,
    a.true_water_source_score AS audit_score,
    wq.subjective_quality_score AS employee_score
    
FROM 
	md_water_services.auditor_report AS a
JOIN
	visits AS v
ON
	a.location_id = v.location_id
JOIN
	water_quality AS wq
ON
	v.record_id = wq.record_id

WHERE
	a.true_water_source_score != wq.subjective_quality_score
AND
	v.visit_count = 1

LIMIT 5;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+-----------+-----------+----------------------+-------------+----------------+
|  location | record_id | assigned_employee_id | audit_score | employee_score |
+-----------+-----------+----------------------+-------------+----------------+
| AkRu05215 |   21160   |          34          |      3      |       10       |
| KiRu29290 |    7938   |          1           |      3      |       10       |
| KiHa22748 |   43140   |          1           |      9      |       10       |
| SoRu37841 |   18495   |          34          |      6      |       10       |
| KiRu27884 |   33931   |          1           |      1      |       10       |
+-----------+-----------+----------------------+-------------+----------------+

So now we can link the incorrect records to the employees who recorded them. The ID's don't help us to identify them. We have employees' names
stored along with their IDs, so let's fetch their names from the employees table instead of the ID's.

In [23]:
%%sql 
SELECT 
	a.location_id AS location,
	v.record_id,
    v.assigned_employee_id,
    e.employee_name,
    a.true_water_source_score AS audit_score,
    wq.subjective_quality_score AS employee_score
    
FROM 
	md_water_services.auditor_report AS a
JOIN
	visits AS v
ON
	a.location_id = v.location_id
JOIN
	water_quality AS wq
ON
	v.record_id = wq.record_id
JOIN
	employee AS e
ON
	v.assigned_employee_id = e.assigned_employee_id

WHERE
	a.true_water_source_score != wq.subjective_quality_score
AND
	v.visit_count = 1

LIMIT 5;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+-----------+-----------+----------------------+---------------+-------------+----------------+
|  location | record_id | assigned_employee_id | employee_name | audit_score | employee_score |
+-----------+-----------+----------------------+---------------+-------------+----------------+
| AkRu05215 |   21160   |          34          |   Rudo Imani  |      3      |       10       |
| KiRu29290 |    7938   |          1           |  Bello Azibo  |      3      |       10       |
| KiHa22748 |   43140   |          1           |  Bello Azibo  |      9      |       10       |
| SoRu37841 |   18495   |          34          |   Rudo Imani  |      6      |       10       |
| KiRu27884 |   33931   |          1           |  Bello Azibo  |      1      |       10       |
+-----------+-----------+----------------------+---------------+-------------+----------------+

Well this query is massive and complex, so maybe it is a good idea to save this as a CTE, so when we do more analysis, we can just call that CTE
like it was a table. Call it something like Incorrect_records. Once you are done, check if this query SELECT * FROM Incorrect_records, gets
the same table back.

In [25]:
%%sql
WITH Incorrect_records AS
(SELECT 
	a.location_id AS location,
	v.record_id,
    v.assigned_employee_id,
    e.employee_name,
    a.true_water_source_score AS audit_score,
    wq.subjective_quality_score AS employee_score
    
FROM 
	md_water_services.auditor_report AS a
JOIN
	visits AS v
ON
	a.location_id = v.location_id
JOIN
	water_quality AS wq
ON
	v.record_id = wq.record_id
JOIN
	employee AS e
ON
	v.assigned_employee_id = e.assigned_employee_id

WHERE
	a.true_water_source_score != wq.subjective_quality_score
AND
	v.visit_count = 1)
SELECT
	*
FROM
	Incorrect_records
LIMIT 5;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+-----------+-----------+----------------------+---------------+-------------+----------------+
|  location | record_id | assigned_employee_id | employee_name | audit_score | employee_score |
+-----------+-----------+----------------------+---------------+-------------+----------------+
| AkRu05215 |   21160   |          34          |   Rudo Imani  |      3      |       10       |
| KiRu29290 |    7938   |          1           |  Bello Azibo  |      3      |       10       |
| KiHa22748 |   43140   |          1           |  Bello Azibo  |      9      |       10       |
| SoRu37841 |   18495   |          34          |   Rudo Imani  |      6      |       10       |
| KiRu27884 |   33931   |          1           |  Bello Azibo  |      1      |       10       |
+-----------+-----------+----------------------+---------------+-------------+----------------+

Let's first get a unique list of employees from this table. Think back to the start of your SQL journey to answer this one. I got 17 employees.

In [26]:
%%sql
SELECT
	DISTINCT employee_name
FROM
	Incorrect_records;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

17 rows affected.

+----------------+
| employee_name  |
+----------------+
|   Rudo Imani   |
|  Bello Azibo   |
| Zuriel Matembo |
| Yewande Ebele  |
| Jengo Tumaini  |
|   Farai Nia    |
| Malachi Mavuso |
|  Makena Thabo  |
| Lalitha Kaburi |
|  Gamba Shani   |
+----------------+
Truncated to displaylimit of 10.

Next, let's try to calculate how many mistakes each employee made. So basically we want to count how many times their name is in
Incorrect_records list, and then group them by name, right?

In [30]:
%%sql
WITH Incorrect_records AS
(SELECT 
	a.location_id AS location,
	v.record_id,
    v.assigned_employee_id,
    e.employee_name,
    a.true_water_source_score AS audit_score,
    wq.subjective_quality_score AS employee_score
    
FROM 
	md_water_services.auditor_report AS a
JOIN
	visits AS v
ON
	a.location_id = v.location_id
JOIN
	water_quality AS wq
ON
	v.record_id = wq.record_id
JOIN
	employee AS e
ON
	v.assigned_employee_id = e.assigned_employee_id

WHERE
	a.true_water_source_score != wq.subjective_quality_score
AND
	v.visit_count = 1)
SELECT
	employee_name,
    COUNT(*) AS number_of_mistakes
FROM
	Incorrect_records
GROUP BY 
	employee_name
LIMIT 5;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------+--------------------+
| employee_name  | number_of_mistakes |
+----------------+--------------------+
|   Rudo Imani   |         5          |
|  Bello Azibo   |         26         |
| Zuriel Matembo |         17         |
| Yewande Ebele  |         3          |
| Jengo Tumaini  |         3          |
+----------------+--------------------+

Let's start by cleaning up our code a bit. First, Incorrect_records is a result we'll be using for the rest of the analysis, but it makes the
query a bit less readable. So, let's convert it to a VIEW. We can then use it as if it was a table. It will make our code much simpler to read, but, it
comes at a cost. We can add comments to CTEs in our code, so if we return to that query a year later, we can read those comments and quickly
understand what Incorrect_records represents. If we save it as a VIEW, it is not as obvious. So we should add comments in places where we
use Incorrect_records.

In [ ]:
CREATE VIEW Incorrect_records AS (
SELECT
auditor_report.location_id,
visits.record_id,
employee.employee_name,
auditor_report.true_water_source_score AS auditor_score,
wq.subjective_quality_score AS employee_score,
auditor_report.statements AS statements
FROM
auditor_report
JOIN
visits
ON auditor_report.location_id = visits.location_id
JOIN
water_quality AS wq
ON visits.record_id = wq.record_id
JOIN
employee
ON employee.assigned_employee_id = visits.assigned_employee_id
WHERE
visits.visit_count =1
AND auditor_report.true_water_source_score != wq.subjective_quality_score);

In [31]:
%%sql
SELECT 
    *
FROM
    Incorrect_records
LIMIT 5;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+-------------+-----------+---------------+---------------+----------------+----------------------------------------------------------------------------------------------------------------------------------------+
| location_id | record_id | employee_name | auditor_score | employee_score |                                                               statements                                                               |
+-------------+-----------+---------------+---------------+----------------+----------------------------------------------------------------------------------------------------------------------------------------+
|  AkRu05215  |   21160   |   Rudo Imani  |       3       |       10       |                Villagers admired the official's visit for its respectful interactions, hard work, and genuine concern.                 |
|  KiRu29290  |    7938   |  Bello Azibo  |       3       |       10       |            A young artist sketches the faces in the queue, capturing the weariness of daily hours spent waiting for water.             |
|  KiHa22748  |   43140   |  Bello Azibo  |       9       |       10       |                  A young girl's hopeful eyes are clouded by mistrust, her innocence tarnished by the corrupt system.                   |
|  SoRu37841  |   18495   |   Rudo Imani  |       6       |       10       | The official's respectful and diligent presence was met with heartfelt appreciation, creating a sense of closeness with the villagers. |
|  KiRu27884  |   33931   |  Bello Azibo  |       1       |       10       |                 A traditional healer's empathy turns to bitterness, knowing that corrupt practices harm her community.                 |
+-------------+-----------+---------------+---------------+----------------+----------------------------------------------------------------------------------------------------------------------------------------+

Next, we convert the query error_count, we made earlier, into a CTE. Test it to make sure it gives the same result again, using SELECT * FROM
Incorrect_records. On large queries like this, it is better to build the query, and test each step, because fixing errors becomes harder as the
query grows.

In [34]:
%%sql
WITH error_count AS ( -- This CTE calculates the number of mistakes each employee made
SELECT
employee_name,
COUNT(employee_name) AS number_of_mistakes
FROM
Incorrect_records
-- Incorrect_records is a view that joins the audit report to the database
-- for records where the auditor and
-- employees scores are different


GROUP BY
employee_name)
-- Query
SELECT 
	* 
FROM 
	error_count
LIMIT 5;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------+--------------------+
| employee_name  | number_of_mistakes |
+----------------+--------------------+
|   Rudo Imani   |         5          |
|  Bello Azibo   |         26         |
| Zuriel Matembo |         17         |
| Yewande Ebele  |         3          |
| Jengo Tumaini  |         3          |
+----------------+--------------------+

Now calculate the average of the number_of_mistakes in error_count. You should get a single value.

In [35]:
%%sql
WITH error_count AS ( -- This CTE calculates the number of mistakes each employee made
SELECT
employee_name,
COUNT(employee_name) AS number_of_mistakes
FROM
Incorrect_records
-- Incorrect_records is a view that joins the audit report to the database
-- for records where the auditor and
-- employees scores are different


GROUP BY
employee_name)
-- Query
SELECT 
    AVG(number_of_mistakes)
FROM 
	error_count
LIMIT 5;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+-------------------------+
| AVG(number_of_mistakes) |
+-------------------------+
|          6.0000         |
+-------------------------+

To find the employees who made more mistakes than the average person, we need the employee's names, the number of mistakes each one
made, and filter the employees with an above-average number of mistakes.
HINT: Use SELECT AVG(mistake_count) FROM error_count as a custom filter in the WHERE part of our query.

In [36]:
%%sql
WITH error_count AS ( 
    SELECT
        employee_name,
        COUNT(employee_name) AS number_of_mistakes
    FROM
        Incorrect_records

    GROUP BY
        employee_name)
-- Query
SELECT 
	* 
FROM 
	error_count
WHERE
    number_of_mistakes > (SELECT 
                            AVG(number_of_mistakes)
                          FROM 
                             error_count)
LIMIT 5;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

4 rows affected.

+----------------+--------------------+
| employee_name  | number_of_mistakes |
+----------------+--------------------+
|  Bello Azibo   |         26         |
| Zuriel Matembo |         17         |
| Malachi Mavuso |         21         |
| Lalitha Kaburi |         7          |
+----------------+--------------------+

These are the employees who made more mistakes, on average, than their peers, so let's have a closer look at them.Lets call them the suspect_list

First, convert the suspect_list to a CTE, so we can use it to filter the records from these four employees. Make sure you get the names of the
four "suspects", and their mistake count as a result, using SELECT employee_name FROM suspect_list.

In [37]:
%%sql
WITH suspect_list AS(
WITH error_count AS ( 
    SELECT
        employee_name,
        COUNT(employee_name) AS number_of_mistakes
    FROM
        Incorrect_records

    GROUP BY
        employee_name)
-- Query
SELECT 
	* 
FROM 
	error_count
WHERE
    number_of_mistakes > (SELECT 
                            AVG(number_of_mistakes)
                          FROM 
                             error_count))
SELECT 
	*
FROM 	
	suspect_list;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

4 rows affected.

+----------------+--------------------+
| employee_name  | number_of_mistakes |
+----------------+--------------------+
|  Bello Azibo   |         26         |
| Zuriel Matembo |         17         |
| Malachi Mavuso |         21         |
| Lalitha Kaburi |         7          |
+----------------+--------------------+

Now we can filter that Incorrect_records CTE to identify all of the records associated with the four employees we identified.

Firstly, let's add the statements column to the Incorrect_records CTE. Then pull up all of the records where the employee_name is in the
suspect list. HINT: Use SELECT employee_name FROM suspect_list as a subquery in WHERE.

In [39]:
%%sql 
WITH suspect_list AS(
WITH error_count AS ( 
    SELECT
        employee_name,
        COUNT(employee_name) AS number_of_mistakes
    FROM
        Incorrect_records

    GROUP BY
        employee_name)
-- Query
SELECT 
	* 
FROM 
	error_count
WHERE
    number_of_mistakes > (SELECT 
                            AVG(number_of_mistakes)
                          FROM 
                             error_count))
SELECT 
	*
FROM 	
	incorrect_records
WHERE
	employee_name IN( (SELECT employee_name FROM suspect_list))
LIMIT 5;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+-------------+-----------+----------------+---------------+----------------+--------------------------------------------------------------------------------------------------------------------+
| location_id | record_id | employee_name  | auditor_score | employee_score |                                                     statements                                                     |
+-------------+-----------+----------------+---------------+----------------+--------------------------------------------------------------------------------------------------------------------+
|  KiRu29290  |    7938   |  Bello Azibo   |       3       |       10       |  A young artist sketches the faces in the queue, capturing the weariness of daily hours spent waiting for water.   |
|  KiHa22748  |   43140   |  Bello Azibo   |       9       |       10       |        A young girl's hopeful eyes are clouded by mistrust, her innocence tarnished by the corrupt system.         |
|  KiRu27884  |   33931   |  Bello Azibo   |       1       |       10       |       A traditional healer's empathy turns to bitterness, knowing that corrupt practices harm her community.       |
|  KiZu31170  |   17950   | Zuriel Matembo |       9       |       10       | A community leader stood with his people, expressing concern for the water quality and the time lost in queues."," |
|  AkRu06495  |   45924   |  Bello Azibo   |       2       |       10       |    A healthcare worker in the queue expressed fears about water-borne diseases, her face etched with worry.","     |
+-------------+-----------+----------------+---------------+----------------+--------------------------------------------------------------------------------------------------------------------+

OR

In [42]:
%%sql
WITH error_count AS ( -- This CTE calculates the number of mistakes each employee made
SELECT
employee_name,
COUNT(employee_name) AS number_of_mistakes
FROM
Incorrect_records


GROUP BY
employee_name),
suspect_list AS (-- This CTE SELECTS the employees with aboveaverage mistakes
SELECT
employee_name,
number_of_mistakes
FROM
error_count
WHERE
number_of_mistakes > (SELECT AVG(number_of_mistakes) FROM error_count))
-- This query filters all of the records where the "corrupt" employees gathered data.
SELECT
employee_name,
location_id,
statements
FROM
Incorrect_records
WHERE
employee_name in (SELECT employee_name FROM suspect_list)
LIMIT 5;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------+-------------+--------------------------------------------------------------------------------------------------------------------+
| employee_name  | location_id |                                                     statements                                                     |
+----------------+-------------+--------------------------------------------------------------------------------------------------------------------+
|  Bello Azibo   |  KiRu29290  |  A young artist sketches the faces in the queue, capturing the weariness of daily hours spent waiting for water.   |
|  Bello Azibo   |  KiHa22748  |        A young girl's hopeful eyes are clouded by mistrust, her innocence tarnished by the corrupt system.         |
|  Bello Azibo   |  KiRu27884  |       A traditional healer's empathy turns to bitterness, knowing that corrupt practices harm her community.       |
| Zuriel Matembo |  KiZu31170  | A community leader stood with his people, expressing concern for the water quality and the time lost in queues."," |
|  Bello Azibo   |  AkRu06495  |    A healthcare worker in the queue expressed fears about water-borne diseases, her face etched with worry.","     |
+----------------+-------------+--------------------------------------------------------------------------------------------------------------------+

If you have a look, you will notice some alarming statements about these four officials (look at these records: AkRu04508, AkRu07310,
KiRu29639, AmAm09607, for example. See how the word "cash" is used a lot in these statements.

Filter the records that refer to "cash".

In [43]:
%%sql
WITH error_count AS ( -- This CTE calculates the number of mistakes each employee made
SELECT
employee_name,
COUNT(employee_name) AS number_of_mistakes
FROM
Incorrect_records


GROUP BY
employee_name),
suspect_list AS (-- This CTE SELECTS the employees with aboveaverage mistakes
SELECT
employee_name,
number_of_mistakes
FROM
error_count
WHERE
number_of_mistakes > (SELECT AVG(number_of_mistakes) FROM error_count))
-- This query filters all of the records where the "corrupt" employees gathered data.
SELECT
employee_name,
location_id,
statements
FROM
Incorrect_records
WHERE
employee_name in (SELECT employee_name FROM suspect_list)
AND
 statements LIKE '%cash%';

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

19 rows affected.

+----------------+-------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| employee_name  | location_id |                                                                                              statements                                                                                              |
+----------------+-------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| Zuriel Matembo |  SoRu38331  |      An unsettling atmosphere surrounded the official, as villagers shared their experiences of arrogance and lack of dedication. The mention of cash exchanges only intensified their doubts.       |
| Malachi Mavuso |  AmAm09607  |            Villagers spoke of an unsettling encounter with an official who appeared dismissive and detached. The reference to cash transactions added to their growing sense of distrust.            |
|  Bello Azibo   |  KiIs23853  |            Villagers' wary accounts of an official's arrogance and detachment from their concerns raised suspicions. The mention of cash changing hands further tainted their perception.            |
|  Bello Azibo   |  HaSe21323  |            Villagers spoke of an unsettling encounter with an official who appeared dismissive and detached. The reference to cash transactions added to their growing sense of distrust.            |
| Zuriel Matembo |  AkRu05880  |               Villagers' wary accounts of an official's arrogance and detachment from their concerns raised suspicions. The allusion to cash changing hands deepened their skepticism.               |
|  Bello Azibo   |  KiRu27065  |           Villagers expressed their discomfort with an official who displayed a haughty demeanor and negligence. The mention of cash transactions deepened their growing sense of unease.            |
| Malachi Mavuso |  KiRu25347  |              Villagers expressed their discontent with an official who appeared dismissive and neglectful. The mention of cash changing hands added to their growing sense of distrust.              |
| Zuriel Matembo |  SoIl32575  | Villagers recounted unsettling encounters with an official known for their arrogance and avoidance of responsibilities. The mention of cash changing hands added to their apprehension and distrust. |
|  Bello Azibo   |  AkRu04508  |      An unsettling atmosphere surrounded the official, as villagers shared their experiences of arrogance and lack of dedication. The mention of cash exchanges only intensified their doubts.       |
| Lalitha Kaburi |  AkRu07310  |                Villagers spoke of their unsettling encounters with an official who seemed indifferent and uninterested, hinting at potential improprieties involving cash exchanges.                 |
+----------------+-------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
Truncated to displaylimit of 10.

Check if there are any employees in the Incorrect_records table with statements mentioning "cash" that are not in our suspect list. This should
be as simple as adding one word.

In [45]:
%%sql
WITH error_count AS ( -- This CTE calculates the number of mistakes each employee made
SELECT
employee_name,
COUNT(employee_name) AS number_of_mistakes
FROM
Incorrect_records


GROUP BY
employee_name),
suspect_list AS (-- This CTE SELECTS the employees with aboveaverage mistakes
SELECT
employee_name,
number_of_mistakes
FROM
error_count
WHERE
number_of_mistakes > (SELECT AVG(number_of_mistakes) FROM error_count))
-- This query filters all of the records where the "corrupt" employees gathered data.
SELECT
employee_name,
location_id,
statements
FROM
Incorrect_records
WHERE
employee_name NOT in (SELECT employee_name FROM suspect_list)
AND
 statements LIKE '%cash%';

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

+---------------+-------------+------------+
| employee_name | location_id | statements |
+---------------+-------------+------------+
+---------------+-------------+------------+

I get an empty result, so no one, except the four suspects, has these allegations of bribery.

So we can sum up the evidence we have for Zuriel Matembo, Malachi Mavuso, Bello Azibo and Lalitha Kaburi:
1. They all made more mistakes than their peers on average.
2. They all have incriminating statements made against them, and only them.
Keep in mind, that this is not decisive proof, but it is concerning enough that we should flag it. Pres. Naledi has worked hard to stamp out
corruption, so she would urge us to report this.